In [2]:
import os
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import talib

In [6]:
amzn=pd.read_csv('AMZN_data.csv',index_col=0)

In [7]:
amzn.head()

                Open      High       Low     Close  Adj Close      Volume
Date
1999-01-04  2.730729  2.966667  2.665625  2.957813   2.957813   785844000
1999-01-05  2.739063  3.243750  2.662500  3.112500   3.112500  1257464000
1999-01-06  3.409375  3.509375  3.350000  3.450000   3.450000   723532000
1999-01-07  3.428125  4.006250  3.325000  3.971875   3.971875   945492000
1999-01-08  4.606250  4.978125  3.800000  4.006250   4.006250  1333244000

In [8]:
amzn.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6039 entries, 1999-01-04 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       6039 non-null   float64
 1   High       6039 non-null   float64
 2   Low        6039 non-null   float64
 3   Close      6039 non-null   float64
 4   Adj Close  6039 non-null   float64
 5   Volume     6039 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 330.3+ KB

1. Change index date to datetime
2. change columns names to lower case
--- there is no nulls
3. change all decimals for up two-three decimal spaces.
4. create data Dictionary